{
  "architectures": ["XLMRobertaModel"],
  "model_type": "xlm-roberta",
  "hidden_size": 384,
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "intermediate_size": 1536,
  "vocab_size": 250037,
  "max_position_embeddings": 514,
  "type_vocab_size": 1,
  "pad_token_id": 1,
  "layer_norm_eps": 1e-05,
  "hidden_act": "gelu",
  "position_embedding_type": "absolute",
  "attention_probs_dropout_prob": 0.1,
  "hidden_dropout_prob": 0.1
}
